gicking/STM8_headers/SVD/STM8L151R6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ITC_SPR</name>
      <baseAddress>0x7F70</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0008</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ITC_SPR</description>
      <groupName>ITC_SPR</groupName>
      <registers>
        <register>
          <name>SPR1</name>
          <description>Interrupt Software priority register 1</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT0SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT1SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT2SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT3SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR2</name>
          <description>Interrupt Software priority register 2</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT4SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT5SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT6SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT7SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR3</name>
          <description>Interrupt Software priority register 3</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT8SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT9SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT10SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT11SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR4</name>
          <description>Interrupt Software priority register 4</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT12SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT13SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT14SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT15SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR5</name>
          <description>Interrupt Software priority register 5</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT16SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT17SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT18SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT19SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR6</name>
          <description>Interrupt Software priority register 6</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT20SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT21SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT22SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT23SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR7</name>
          <description>Interrupt Software priority register 7</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT24SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT25SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT26SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT27SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR8</name>
          <description>Interrupt Software priority register 8</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT28SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT29SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
